app/views/welcome/index.html.erb

  <% else %>
    <%= render  Product.all , locals: {renderer: @renderer}%>
---
SELECT "products".* FROM "products"