app/controllers/application_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def load_cart
    @cart = Product.find(session[:cart].keys)