app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "111111111"], ["user_id", 1], ["product_id", 6], ["created_at", "2022-07-27 07:42:28.536625"], ["updated_at", "2022-07-27 07:42:28.536625"]]
---
  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.build(comment_params)
    @comment.user_id = current_user.id
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 11]]
---
  def destroy
    @comment = Comment.find(params[:id])
    authorize @comment
    @product = @comment.product
    @comment.destroy