app/controllers/products_controller.rb

  def update
    @product = current_user.products.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]