app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["description", ""], ["user_id", 1], ["created_at", "2022-07-27 10:09:35.283718"], ["updated_at", "2022-07-27 10:09:35.283718"]]
---
  def create
    @product = current_user.products.new(product_params)
    if @product.save

UPDATE "products" SET "quantity" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["quantity", 222], ["updated_at", "2022-07-26 14:45:25.008629"], ["id", 1]]
---
  def update
    if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 8]]
---
  def destroy
    if @product.destroy