app/controllers/welcome_controller.rb

  def index
    @renderer = 'welcomeIndex'
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (user_id != current_user.id)